docs: update docs to reflect latest implementation progress, change text-based chart to mermaid chart, fix markdownlint
